# Przetwarzanie danych w Pythonie - Pandas

![](https://upload.wikimedia.org/wikipedia/commons/e/ed/Pandas_logo.svg)

## Pandas

Kolejną biblioteką którą poznamy będzie Pandas. Pandas to pakiet zbudowany na bazie NumPy który dostarcza nam obiekty typu `DataFrame`, które są wielowymiarowymi tabelami z indeksami dla kolumn i wierszy. Poznamy dzisiaj w jaki sposób korzystać z abstrakcji dostarczanych przez Pandas i jak pracować z obiektami będacymi częścią tego pakietu.

Zaczniemy od zaimportowania pakietu:

In [1]:
import pandas as pd
import numpy as np

### Series

`Series` jest jednowymiarową tablicą danych z indeksem, można go stworzyć z listy lub tabeli:

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
print(data)

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

`index` jest typu `pd.Index`, o którymi opowiem za chwilę:

In [4]:
print(data.index)

RangeIndex(start=0, stop=4, step=1)

In [5]:
print(type(data.index))

<class 'pandas.core.indexes.range.RangeIndex'>

`values` jest zwykłą numpy tablicą reprezentująca wartości danego `Series`:

In [6]:
print(data.values)

[0.25 0.5  0.75 1.  ]

In [7]:
print(type(data.values))

<class 'numpy.ndarray'>

Podstawową różnicą między `Series` a zwykłą tablicą, jest fakt, że możemy sami w nim ustalić indeks:

In [8]:
data = pd.Series(      [0.25, 0.5, 0.75, 1.0],
                 index=['a',  'b', 'c',  'd'])  # ustalamy indeks jako obiekty typu `str`
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['b']

0.5

In [10]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])  # indeksy są liczbami, ale nie muszą mieć konkretnej kolejności
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

Tak jak tablice w NumPy reprezentują kolekcje pojedynczego typu co pomaga nam wykonywać pewne operacje szybciej, podobnie `Series` możemy rozumieć jako implementacje mapy (słownika) zawierającej wartości tego samego typu:

In [11]:
population_dict = {'California': 38332521,
                   'Texas'     : 26448193,
                   'New York'  : 19651127,
                   'Florida'   : 19552860,
                   'Illinois'  : 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [12]:
population['California']

38332521

Jednak wciąż możemy korzystać z operacji typowych dla tablic jak np. slice:

In [13]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Obiekty typu `Series` możemy tworzyć na różne sposoby:

In [14]:
pd.Series([2, 4, 6])  # z listy

0    2
1    4
2    6
dtype: int64

In [15]:
pd.Series(5, index=[1, 2, 3])  # jako jedna wartość, która jest powtarzana dla indeksów

1    5
2    5
3    5
dtype: int64

In [16]:
pd.Series({2: 'a', 1: 'b', 3: 'c'})  # ze słownika

2    a
1    b
3    c
dtype: object

In [17]:
pd.Series(np.arange(10))  # z tablicy numpy

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

### DataFrame

`DataFrame` jest analogią do dwuwymiarowej tablicy NumPy, która ma dowolnie zdefiniowany indeks zarówno dla wierszy i kolumn. `DataFrame` jest kolekcją obiektów typu `Series` o wspólnym indeksie:

In [18]:
area_dict = {'California': 423967,
             'Texas'     : 695662,
             'New York'  : 141297,
             'Florida'   : 170312,
             'Illinois'  : 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

Zauważ jak obiekt typu `DataFrame` powstaje przez przekazanie słownika którego klucze są nazwami kolumn, a wartościami są obiekty typu `Series`:

In [21]:
states = pd.DataFrame({
    'population': population,
    'area'      : area
})  # Tworzymy obiekt typu `DataFrame`
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

`DataFrame` posiada atrybut `index` który dostarcza nam indeksy wierszy, oraz atrybut `columns` który dostarcza indeksy kolumn.

In [22]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [23]:
states.columns

Index(['population', 'area'], dtype='object')

Tworzenie obiektów typu `DataFrame`:

In [24]:
pd.DataFrame(population, columns=['population'])  # z jednego `Series`

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [27]:
data = [{'a': i, 'b': 2 * i} for i in range(3)]
# data
pd.DataFrame(data)  # z listy słowników

   a  b
0  0  0
1  1  2
2  2  4

In [28]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])  # pandas sam wypełni brakujące indeksy

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [29]:
pd.DataFrame({
    'population': population,
    'area': area
})  # słownik `Series`

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [35]:
pd.DataFrame(
    np.random.rand(3, 2),
    columns=['foo', 'bar'],
    index=['a', 'b', 'c']    
)  # z dwuwymiarowej tablicy numpy

        foo       bar
a  0.119680  0.218867
b  0.973593  0.855128
c  0.994329  0.806018

### Index

`Index` bardzo przypomina tablicę numpy z tą różnicą, że obiekty typu `Index` są niemutowalne:

In [36]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [37]:
ind[1] = 0

TypeError: Index does not support mutable operations

### Indeksowanie i wybieranie danych

Ponieważ obiekty typu `Series` posiadają swój indeks, ale mogą być również indeksowane z użyciem domyślnego indeksu z numpy, musimy dobrze rozumieć kiedy korzystamy z którego indeksowania:

In [38]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [39]:
data[1]  # indeks typu `Series`

'a'

In [40]:
data[1:3]  # indeks z numpy

3    b
5    c
dtype: object

Aby lepiej wiedzieć kiedy korzystamy z którego indeksu istnieją atrybuty `loc` oraz `iloc`.

`loc` używa indeksu z `Series`:

In [41]:
data

1    a
3    b
5    c
dtype: object

In [42]:
data.loc[1]

'a'

In [43]:
data.loc[1:3]

1    a
3    b
dtype: object

`iloc` korzysta z indeksów tablicy numpy

In [44]:
data

1    a
3    b
5    c
dtype: object

In [45]:
data.iloc[1]

'b'

In [46]:
data.iloc[1:3]

3    b
5    c
dtype: object

### Wybieranie danych z DataFrame

Pierwszy sposób w jaki możemy wybierać dane z DataFrame, to traktując go jako słownik typu `Series`:

In [60]:
area = pd.Series({
    'California': 423967,   'Texas'  : 695662,
    'New York'  : 141297,   'Florida': 170312,
    'Illinois'  : 149995
})
pop = pd.Series({
    'California': 38332521, 'Texas'  : 26448193,
    'New York'  : 19651127, 'Florida': 19552860,
    'Illinois'  : 12882135
})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [62]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [63]:
data['density'] = data['pop'] / data['area']

In [64]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

Z drugiej strony możemy myśleć o DataFrame jako o rozbudowanej dwuwymiarowej tablicy:

In [65]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [52]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

In [66]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [67]:
data.iloc[0, 2] = 90

In [68]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Operowanie na brakujących danych w Pandas

W Pythonie brakujące wartości możemy reprezentować jako `None`, jednak ponieważ `None` jest singletonem (ma własny typ i istnieje tylko jeden obiekt typu `None`), to nie możemy go sprawnie używać w NumPy:

In [69]:
vals1 = np.array([1, None, 3, 4])

In [70]:
vals1

array([1, None, 3, 4], dtype=object)

In [71]:
vals1.dtype

dtype('O')

Ponieważ jedyny wspólny typ dla tych obiektów to typ `object`, wszystkie operacje będą wykonywane dla pojedynczych elementów i tracimy wektorowość.

`object` (bardzo wolno):

In [72]:
%timeit np.arange(2_000_000, dtype=object).sum()

64.8 ms ± 846 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

`int` (bardzo szybko):

In [73]:
%timeit np.arange(2_000_000, dtype=int).sum()

1.57 ms ± 25.5 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

Nie możemy również korzystać z operacji liczbowych:

In [74]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

Innym sposobem reprezentacji brakujących danych liczbowych jest użycie `NaN` - _not a number_

In [75]:
vals2 = np.array([1, np.nan, 3, 4])

In [76]:
vals2

array([ 1., nan,  3.,  4.])

In [77]:
vals2.dtype

dtype('float64')

Dzięki temu zachowujemy liczbowy typ, jednak operacje liczbowe wciąż są źle zdefiniowane:

In [78]:
vals2

array([ 1., nan,  3.,  4.])

In [79]:
1 + np.nan

nan

In [80]:
vals2.sum()

nan

In [81]:
vals2.min()

nan

In [82]:
vals2.max()

nan

Korzystając z NumPy możemy użyć specjalnych funkcji omijających NumPy:

In [83]:
vals2

array([ 1., nan,  3.,  4.])

In [84]:
np.nansum(vals2)

8.0

In [85]:
np.nanmin(vals2)

1.0

In [89]:
np.nanmax(vals2)

4.0

#### NaN i None w Pandas

Pandas traktuje `NaN` i `None` w ten sam sposób:

In [90]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

W Pandas mamy również specjalne metody które pozwalają nam znajdować, usuwać i wypełniać puste wartości:

In [91]:
data = pd.Series([1, np.nan, 'hello', None])

In [92]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [93]:
data.isnull()  # znajdowanie pustych wartości

0    False
1     True
2    False
3     True
dtype: bool

In [94]:
data[data.notnull()]  # wybieranie niepustych wartości

0        1
2    hello
dtype: object

In [95]:
data.dropna()  # usuwanie pustych wartości

0        1
2    hello
dtype: object

In [96]:
data.fillna(0)  # wypełnianie pustych wartości

0        1
1        0
2    hello
3        0
dtype: object

### Łączenie DataFrame w Pandas

Funkcją służącą do łączenia `DataFrame` jest `pd.concat`, która w działaniu jest podobna do `np.concatenate`.

In [98]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])

In [99]:
ser1

1    A
2    B
3    C
dtype: object

In [100]:
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [101]:
ser2

4    D
5    E
6    F
dtype: object

In [102]:
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [103]:
def make_df(cols, ind):
    """Stwórz DataFrame z kombinacji cols i ind"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [104]:
# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [105]:
df1 = make_df('AB', [1, 2])

In [106]:
df1

    A   B
1  A1  B1
2  A2  B2

In [107]:
df2 = make_df('AB', [3, 4])

In [108]:
df2

    A   B
3  A3  B3
4  A4  B4

In [109]:
pd.concat([df1, df2])  # łączenie po wierszach

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [110]:
pd.concat([df1, df2], axis=1)  # łączenie po kolumnach

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

Ponieważ łączenie DataFrame jest bardzo typową operacją, możemy (jeszcze) też stosować do tego `.append`.

"Jeszcze", ponieważ metoda `.append` jest już przestarzała i zostanie usunięta z Pandas w przyszłej wersji. Zamiast tego, w przyszłości będzie można używać wyłącznie `.concat`.

In [111]:
df1.append(df2)

/var/folders/_p/66rl240s45j0d661qs7f096c0000gn/T/ipykernel_24521/3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

Innym rodzajem łączenia DataFrame jaki możemy wykonywać są _joiny_ które możemy znać z SQL, joiny w Pandas wykonujemy z użyciem `pd.merge`.

In [112]:
df1 = pd.DataFrame({'employee': ['Bob',        'Jake',        'Lisa',        'Sue'],
                    'group'   : ['Accounting', 'Engineering', 'Engineering', 'HR' ]})

In [113]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [114]:
df2 = pd.DataFrame({'employee' : ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [ 2004,   2008,  2012,   2014]})

In [115]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [116]:
df3 = pd.merge(df1, df2)

In [117]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

`pd.merge` samo rozpoznało wspólną kolumnę `employee` i połączyło tabele z jej użyciem.

Funkcja (właść. metoda) ta ignoruje również indeksy wejściowych data frame, chyba, że korzystamy z łączenia przez indeks.

In [118]:
df4 = pd.DataFrame({'group'     : ['Accounting', 'Engineering', 'HR'   ],
                    'supervisor': ['Carly',      'Guido',       'Steve']})

In [119]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [120]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [122]:
df5 = pd.DataFrame({
    'group' : [
        'Accounting',   
        'Accounting',
        'Engineering',  
        'Engineering',
        'HR',           
        'HR'],
    'skills': [
        'math',         
        'spreadsheets',
        'coding',       
        'linux',
        'spreadsheets', 
        'organization']
})

In [123]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [124]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

Jeżeli chcemy wprost powiedzieć po której kolumnie chcemy wykonać łączenie możemy podać ją przez parametr `on`:

In [125]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

Jeżeli tabele mają różne nazwy kolumn po których chcemy je połączyć możemy skorzystać z `left_on` i `right_on`

In [126]:
df3 = pd.DataFrame({
    'name': [
        'Bob',
        'Jake',
        'Lisa', 
        'Sue'],
    'salary': [
        70000,
        80000,
        120000,
        90000]})

In [127]:
pd.merge(df1, df3, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

Ponieważ taka tabela ma zbedną kolumnę, możemy ją usunąc przez `drop`:

In [128]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [130]:
pd.merge?

Rodzaj łączenia wybieramy przez parametr `how`.
Możliwe wartości dla tego parametru to:

- **left**
- **right**
- **outer**
- **inner**
- **cross**

In [131]:
df1 = make_df('AB', [1, 2, 4])

In [132]:
df1

    A   B
1  A1  B1
2  A2  B2
4  A4  B4

In [133]:
df2 = make_df('ABCD', [1, 2, 5, 6])

In [134]:
df2

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
5  A5  B5  C5  D5
6  A6  B6  C6  D6

Przykłady różnych typów operacji join...

`df1` **left** join `df2`:

In [135]:
pd.merge(df1, df2, on='A', how='left')

    A B_x  B_y    C    D
0  A1  B1   B1   C1   D1
1  A2  B2   B2   C2   D2
2  A4  B4  NaN  NaN  NaN

`df1` **right** join `df2`:

In [136]:
pd.merge(df1, df2, on='A', how='right')

    A  B_x B_y   C   D
0  A1   B1  B1  C1  D1
1  A2   B2  B2  C2  D2
2  A5  NaN  B5  C5  D5
3  A6  NaN  B6  C6  D6

`df1` **outer** join `df2`:

In [137]:
pd.merge(df1, df2, on='A', how='outer')

    A  B_x  B_y    C    D
0  A1   B1   B1   C1   D1
1  A2   B2   B2   C2   D2
2  A4   B4  NaN  NaN  NaN
3  A5  NaN   B5   C5   D5
4  A6  NaN   B6   C6   D6

`df1` **inner** join `df2`:

In [138]:
pd.merge(df1, df2, on='A', how='inner')

    A B_x B_y   C   D
0  A1  B1  B1  C1  D1
1  A2  B2  B2  C2  D2

### Agregacja i grupowanie

Agregacje jakie domyślnie możemy stosować w Pandas są analogiczne do tych które występują w NumPy. Wywołanie agregacji na `DataFrame` zwraca wynik dla każdej kolumny:

In [173]:
df = pd.DataFrame({
    'A': np.random.rand(5),
    'B': np.random.rand(5)
})

In [174]:
df

          A         B
0  0.950188  0.749528
1  0.014814  0.115465
2  0.906468  0.021168
3  0.491307  0.997087
4  0.512653  0.597400

In [176]:
df.mean()

A    0.575086
B    0.496130
dtype: float64

Inne agregacje jakie możemy wykonywać:

- `count()`
- `first()`, `last()`
- `mean()`, `median()`
- `min()`, `max()`
- `std()`, `var()`
- `mad()`
- `prod()`
- `sum()`

Aby móc wykonywać bardziej skomplikowane zapytania, musimy jednak połączyć agregacje z odpowiednim grupowaniem. Grupowanie polega na podzieleniu zbioru danych na mniejsze zbiory na podstawie unikalnych wartości w kolumnie po której grupujemy i wykonaniu danej agregacji. Wyniki agregacji są następnie łączone w nowy zbiór danych. Nie musimy jednak wykonywać tych operacji samodzielnie - służy do tego funkcja `groupby`.

In [160]:
df = pd.DataFrame(
    {
        'key' : ['A', 'B', 'C', 'A', 'B', 'C'],
        'data': range(6)
    },
    columns=['key', 'data']
)

In [161]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [162]:
df.groupby('key')

Wynik działania `groupby` to obiekt typu `DataFrameGroupBy`.

Na takim obiekcie możemy następnie wywołać funkcję agregująca która wykona wszystkie operacje potrzebne do obliczenia wyniku grupowania:

In [163]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

Co więcej obiekt typu `GroupBy` wspiera również indeksowanie:

In [164]:
df.groupby('key')['data'].median()

key
A    1.5
B    2.5
C    3.5
Name: data, dtype: float64